Repository: synspawacza/automata_pl
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: pl

source: believe in yourself.
pl: uwierz w siebie.

source: below dark skies
pl: pod ciemnym niebem

source: best I'm so grateful for all the—I'm doing it again, aren't I? I'm talking too much. Well, YOU started it, so let's keep the conversation going!
pl: najlepsi... Jestem im taka wdzięczna, że... Znowu to robię, prawda? Za dużo gadam. Cóż, to WY zaczęliście, więc lepiej kontynuujmy rozmowę!

source: break a leg!
pl: połamania nóg!

source: break ti[M]e
pl: czas na przyje[M]ności

source: broken [W]ings
pl: z[W]ichnięte skrzydła

source: brought suddenly to an end
pl: spotkał nagły koniec

source: but locks on each sub-unit must be deactivated before accessing the main Tower.
pl: ale zamki w każdej podjednostce muszą zostać zdezaktywowane przed uzyskaniem dostępu do głównej Wieży.

source: but special authorization keys are required to access Tower sub-units.
pl: aby uzyskać dostęp do podjednostek Wieży, wymagane są specjalne klucze autoryzacyjne.

source: but this time, the villagers had their cores destroyed as well as their bodies.
pl: ale tym razem rdzenie maszyn z wioski zostały zniszczone wraz z ich ciałami.

source: but we’ll sing
pl: ale śpiewajmy

source: can you avert your eyes and walk away?
pl: czy możesz odwrócić wzrok i odejść?

source: cause they had it comin' they had it comin' they had it comin' they had it comin' they had it comin' they had it comin' they had it comin' they had it comin' they had
pl: bo należało im się należało im się należało im się należało im się należało im się należało im się należało im się należało im się należało im się należało im się...

source: challenged the enemy foolishly
pl: bezmyślnie rzucam wyzwanie wrogu

source: chil[D]hood's end
pl: koniec [D]zieciństwa

source: city e[S]cape
pl: ucieczka z mia[S]ta

source: collapsed
pl: upadam

source: coordinate data......location specified......
pl: współrzędne... lokalizacji określonej...

source: corru[P]tion
pl: ze[P]sucie

source: could not get up again
pl: nie mogę znów wstać

source: couldn't even get a hit in
pl: nawet nie mogę trafić

source: couldn't find a weakpoint
pl: nie mogę znaleźć słabości

source: couldn't help but smile
pl: mogę się tylko uśmiechnąć

source: couldn't perform as well as usual
pl: nie jest sobą

source: cried and cried
pl: rozpłakuję się

source: cursed my own idleness
pl: przeklinam własną bezczynność

source: deb[U]nked
pl: zab[U]nkrowanie

source: didn't give up until the very end
pl: nie poddaję się aż do końca

source: died
pl: umieram

source: died an honorable death
pl: umieram honorową śmiercią

source: died peacefully
pl: umieram w spokoju

source: disappear.
pl: zniknij.

source: don't give in to temptation!
pl: nie poddawaj się pokusie!

source: don't give up here!
pl: nie poddawaj się tutaj!

source: don't lose your nerve!
pl: nie trać głowy!

source: don't push yourself.
pl: nie przemęczaj się.

source: don't stay up too late.
pl: nie zostawał do późna.

source: don't throw your life away.
pl: nie marnuj swojego życia.

source: during a pointless battle
pl: podczas bezcelowej bitwy

source: during the decisive battle
pl: podczas decydującej bitwy

source: effort will be rewarded.
pl: wysiłek będzie nagrodzony.

source: enjoyed a tough battle
pl: cieszę się z trudnej bitwy

source: even in video games, you're useless.
pl: nawet w grach wideo jesteś beznadziejny.

source: everyone just stares blankly at me and it's really annoying because when I try to slow down to their level I can't get across what I wanna say but our leader is...
pl: wszyscy tylko patrzą się na mnie tępo, a to jest naprawdę irytujące, bo kiedy próbuję mówić wolniej, to nie jestem w stanie dojść do sedna, ale nasza przywódczyni jest...

source: everything will be fine!
pl: wszystko będzie w porządku.

source: fa[T]al error
pl: fa[T]alny błąd

source: faced away from the enemy
pl: odwraca się od wroga

source: failed to go all-out
pl: nie daję z siebie wszystkiego

source: falling with my next step
pl: upadam z mym kolejnym krokiem

source: feed on despair and survive!
pl: karm się rozpaczą, aby przetrwać!

source: fell
pl: padam

source: fell along with my enemy
pl: upadam wraz z wrogiem

source: fell along with the enemy
pl: upada wraz z wrogiem

source: fell to the ground
pl: upada na ziemię

source: fell with grace
pl: upadam z gracją

source: felt despair at this cold world
pl: czuję rozpacz w tym zimnym świecie

source: felt fate toying with me
pl: wyczuwam drwinę losu

source: felt life slip away
pl: czuje jak życie ucieka

source: felt my life slip away
pl: czuję jak życie ucieka

source: felt my own lack of strength
pl: czuję brak sił

source: felt my own weakness
pl: czuję własną słabość

source: felt the coldness of water
pl: czuję chłód wody

source: felt the hand of fate
pl: wyczuwa drwinę losu

source: felt the heat of sand
pl: czuję ciepło piasku

source: felt utterly powerless
pl: czuje brak sił

source: fight for what's important to you!
pl: walcz o to, co dla ciebie ważne!

source: flowers for m[A]chines
pl: kwiaty dla m[A]szyn

source: for the warmth I seek
pl: dla ciepła którego szukam

source: for what we had
pl: dla tego mieliśmy

source: fought a brave battle
pl: walczę w walecznym boju

source: fought bravely
pl: walczę odważnie

source: fought valiantly
pl: walczę dzielnie

source: fought with all my strength
pl: walczę ze wszystkich sił

source: fought with every ounce of strength
pl: walczy ze wszystkich sił

source: fought with my last strength
pl: walczę do ostatka sił

source: full steam ahead!
pl: cała naprzód!

source: fury, shame, desolation, the future...
pl: wściekłość, wstyd, rozpacz, przyszłość...

source: gave in to doubt
pl: daje się ponieść wątpliwościom

source: gave it all
pl: daje z siebie wszystko

source: get wild, like 2B!
pl: zaszalej, jak 2B!

source: give it one more go.
pl: spróbuj jeszcze jeden raz.

source: give up the game.
pl: zrezygnuj z gry.

source: glory to mankind!
pl: chwała ludzkości!

source: go look for something else to enjoy.
pl: poszukaj czegoś innego do zabawy.

source: goodbye.
pl: żegnaj.

source: got killed
pl: ginę

source: grimaced in anger
pl: krzywię się we wściekłości

source: had no chance against my opponent
pl: nie mam szans z wrogiem

source: had the tables turned
pl: ginie gdy sytuacja się odwróciła

source: had the tables turned on me
pl: ginę gdy sytuacja się odwróciła

source: hang on just a bit longer!
pl: wytrwaj jeszcze chwilę!

source: have anything you would like to say to other players
pl: masz coś, co chciałbyś przekazać innym graczom,

source: have lost your life multiple times to make it this far.
pl: zginąłeś wiele razy, na wiele sposobów, żeby móc dotrzeć aż tutaj.

source: head[Y] battle
pl: upojon[Y] walką

source: heard a girl laughing merrily
pl: słyszę radosny śmiech dziewczynki

source: heard the call of friends
pl: słyszy wołania przyjaciół

source: heard the calls of his friends
pl: słyszę wołania przyjaciół

source: heard the footsteps of machines
pl: słyszę kroki maszyn

source: heard the screams of crazed androids
pl: słyszę krzyk oszalałych androidów

source: heard the screams of crazed machines
pl: słyszę krzyk oszalałych maszyn

source: heard the sound of flowing water
pl: słyszę dźwięk płynącej wody

source: heard the sound of waves
pl: słyszę dźwięk fal

source: held nothing back
pl: walczy do ostatka sił

source: hesitated to kill my foe
pl: waham się z zabiciem wroga

source: hesitated to land the killing blow
pl: waha się z zabiciem wroga

source: hit a wall
pl: czuje własną słabość

source: how about trying to go a little farther?
pl: może spróbuj pójść odrobinę dalej?

source: how beautiful this world is.
pl: z tego, jak wspaniały jest ten świat.

source: hun[G]ry for knowledge
pl: [G]łód wiedzy

source: if you won't do it, who will?
pl: jeśli ty tego nie zrobisz, to kto?

source: in a city reclaimed by nature
pl: w mieście odzyskanym przez naturę

source: in a confusing place
pl: w dezorientującym miejscu

source: in a cradle in the sky
pl: w kołysce nieba

source: in a dark hole beneath a city
pl: w dziurze pod miastem

source: in a deep, dark forest
pl: w głębi ciemnego lasu

source: in a desert of shadows
pl: w cieniach pustyni

source: in a deserted land
pl: w pustynnej krainie

source: in a land of distorted fairy tales
pl: w krainie wykrzywionych baśni

source: in a lush forest
pl: w bujnym lesie

source: in a never-ending spiral of life and death.
pl: w niekończącej się spirali życia i śmierci.

source: in a vain forest
pl: w próżnym lesie

source: in a world of ended dreams
pl: w świecie skończonych marzeń

source: in a world of sand
pl: w świecie piasku

source: in days of sand
pl: spędzając czas na piasku

source: in the abyss
pl: w otchłani

source: in the boring countryside
pl: na nudnej wsi

source: in the deepest darkness
pl: w najgłębszym mroku

source: in the depths of hell
pl: w głębi piekieł

source: in the free skies
pl: na wolnym niebie

source: in the land where he used to live
pl: w kraju gdzie mieszkał

source: inside a tall tower
pl: we wnętrzu wysokiej wieży

source: inside an empty ship
pl: wewnątrz pustego statku

source: instead of the cold
pl: zamiast chłodu

source: it ceased its resistance eight hours ago following your missile strike.
pl: W wyniku ataku rakietami, osiem godzin temu zaprzestała dalszego oporu.

source: it is deserving of life
pl: to zasługiwanie na życie

source: it is programmed to automatically repeat the request every 30 seconds until such data is made available.
pl: została tak zaprogramowana, że będzie automatycznie powtarzać prośbę co 30 sekund. Tak długo, aż takie dane zostaną jej udostępnione.

source: it'll work out if you stay calm.
pl: poradzisz sobie, jeśli tylko zachowasz spokój.

source: it's OK to take a break.
pl: to w porządku zrobić sobie przerwę.

source: it's a game. Go wild!
pl: to gra. Zaszalej!

source: it's all right.
pl: jest dobrze.

source: it's already over.
pl: to już koniec.

source: it's fun!
pl: to frajda!

source: it's just a game. Face reality already!
pl: to tylko gra. Staw już czoła rzeczywistości.

source: it's meaningless.
pl: to bez znaczenia.

source: it's not like you hate it, right?
pl: to nie tak, że nienawidzisz tego, prawda?

source: it's stupid to continue this nonsense.
pl: to głupie kontynuować ten nonsens.

source: it's time to return to the real world.
pl: już czas wrócić do prawdziwego świata.

source: just do better next time.
pl: postaraj się lepiej następnym razem.

source: just forget it.
pl: po prosu zapomnij.

source: just stop playing if you're that bad.
pl: przestań grać, jeśli jesteś taki słaby.

source: just y[O]u and me
pl: tylko z t[O]bą

source: keep going for now.
pl: na razie idź dalej.

source: keep going!
pl: idź dalej!

source: keep trying for just a biiiit longer!
pl: próbuj jeszcze troszeeeeczkę dłużej!

source: knowing that it’s not impossible
pl: wiedząc, że to niemożliwe

source: laughed at my own demise
pl: śmieję się z własnego upadku

source: laughed at the enemy's strength
pl: śmieję się z sił wroga

source: learned a valuable lesson
pl: dostaje cenną lekcję

source: learned my lesson
pl: dostaję nauczkę

source: learned to fear the enemy
pl: uczę się bać wroga

source: let my doubts get the best of me
pl: daję się ponieść wątpliwościom

source: let someone else play for you.
pl: pozwól komuś innemu zagrać za ciebie.

source: let us share in our joy!
pl: pozwól nam podzielić się szczęściem!

source: let's calm down.
pl: uspokój się.

source: let's enjoy this!
pl: czerp z tego radość!

source: let's have some candy.
pl: zjedź cukierka.

source: let's live in solitude.
pl: żyj w samotności.

source: let's sacrifice ourselves.
pl: poświęćmy się.

source: let's see how this really ends.
pl: zobacz, jak się to naprawdę kończy.

source: let's share in our joy!
pl: podzielmy się naszym szczęściem!

source: loners who had found each other
pl: samotnicy, którzy się znaleźli

source: looking down on Earth
pl: spoglądając na Ziemię

source: lost all courage
pl: traci odwagę

source: lost my courage
pl: tracę odwagę

source: lost the battle
pl: przegrywam bitwę

source: mave[R]ick
pl: roz[R]abiaka

source: may be someone you intensely dislike.
pl: może być kimś, kogo bardzo nie lubisz.

source: me which is really nice and hey you know who else is nice? Our leader! She treated my wounds recently because I cut myself carrying some stuff which was dumb but
pl: rozmawiacie, co jest naprawdę miłe z waszej stronya, a wiecie kto jeszcze jest miły? Nasza przywódczyni! Ostatnio opatrzyła moje rany, ponieważ pokaleczyłam się, gdy nosiłam jakieś rzeczy...

source: meaningless [C]ode
pl: bez[C]elowy Kod

source: missed my biggest chance
pl: tracę szansę

source: missed the chance of a lifetime
pl: traci szansę

source: mission [F]ailed
pl: [F]iasko

source: multiplexed it over the memories of some nearby enemies, so that when I returned to my own body, I—
pl: ...więc po prostu przesłałem je do pamięci kilku najbliższych jednostek wroga, dzięki czemu po powrocie do właśnego ciała, ja...

source: my sister and I were the perfect target for persecution. </page>
pl: razem z siostrą stałyśmy się idealnymi celami prześladowania. </page>

source: never give up the struggle!
pl: nigdy nie rezygnuj z walki!

source: never stopped smiling
pl: nie przestaję się uśmiechać

source: never surrender!
pl: nigdy się nie poddawaj!

source: no [I] in team
pl: niezgrana ek[I]pa

source: of my GOD DAMN MEMORIES!
pl: od moich PRZEKLĘTYCH WSPOMNIEŃ!

source: of their hypocrisy
pl: o ich hipokryzji

source: on a collapsed building
pl: na zawalonym budynku

source: on a shining blue surface
pl: na powierzchni błyszczącej błękitem

source: on a tower smiled upon by angels
pl: w wieży do której uśmiechają się anioły

source: on dry sand
pl: na suchym piasku

source: on green pastures
pl: na zielonych pastwiskach

source: on ground of steel
pl: na stalowej ziemi

source: one is doomed to lose sight...
pl: To skaże się na to, że przestanie widzieć...

source: or even amidst the rising flames of war...
pl: a nawet pośród narastającego ognia wojny...

source: or not to [B]e
pl: albo nie [B]yć

source: our final major operation had begun.
pl: ...rozpoczęła się nasza ostatnia, główna operacja.

source: our leader says I should be careful anyway before I really hurt myself and I know she's right but also think she worries too much.
pl: nasza przywódczyni mówi, że cały czas powinnam uważać, aby nie kaleczyć się co chwilę, i wiem, że ma rację, ale też myślę, że za bardzo się martwi.

source: over there
pl: gdzieś tam

source: over[Z]ealous
pl: bezw[Z]ględna

source: plexed it over the memories of some nearby enemies, so that when I returned to my own body, I—
pl: więc, po prostu, rozdzieliłem je między wspomnienia najbliższych wrogich jednostek. A kiedy już wrócę do własnego ciała, ja...

source: push through in one go!
pl: przejdź wszystko za jednym zamachem!

source: put your back into it, you $&*@#!
pl: przyłóż się do tego, ty $&*@#!

source: reckless bra[V]ery
pl: zuch[V]ałość

source: regretted a mistake
pl: żałuje błędów

source: regretted my own mistakes
pl: żałuję błędów

source: regretted nothing
pl: nie żałuję niczego

source: rely on your own strength!
pl: polegaj na swojej sile!

source: rules exist so we can know our freedoms.
pl: zasady istnieją po to, abyśmy mogli poznać naszą wolność.

source: saw a YoRHa once considered a friend
pl: widzę YoRHa który wydawał mi się przyjacielem

source: saw a bitter enemy
pl: widzi znienawidzonego wroga

source: saw a black book
pl: widzę czarną książkę

source: saw a blue bird
pl: widzę błękitnego ptaka

source: saw a caring machine
pl: widzę troskliwą maszynę

source: saw a lost machine
pl: widzę zagubioną maszynę

source: saw a machine behind a tree
pl: widzę maszynę za drzewem

source: saw a machine buried in sand
pl: widzę maszynę zakopaną w piasku

source: saw a machine cover the skies
pl: widzę maszynę pokrywającą niebo

source: saw a machine dancing like mad
pl: widzę maszynę tańczącą jak szalona

source: saw a machine eating its own kind
pl: widzę maszynę zjadającą swoich pobratymców

source: saw a machine end it all
pl: widzę maszynę kończącą to wszystko

source: saw a machine flying around
pl: widzę latającą maszynę

source: saw a machine full of love
pl: widzę maszynę pełną miłości

source: saw a machine imitating a human
pl: widzę maszynę udającą człowieka

source: saw a machine in deep thought
pl: widzę zamyśloną maszynę

source: saw a machine in love with humans
pl: widzę maszynę zakochaną w ludziach

source: saw a machine living for combat
pl: widzę maszynę żyjącą, by walczyć

source: saw a machine living in junk
pl: widzę maszynę żyjącą w złomie

source: saw a machine ponder life and death
pl: widzę maszynę rozmyślającą nad życiem i śmiercią

source: saw a machine taking a walk
pl: widzę przechadzającą się maszynę

source: saw a machine wandering around
pl: widzę włóczącą się maszynę

source: saw a machine with dreams
pl: widzę maszynę z marzeniami

source: saw a pathetic lump of metal
pl: widzę żałosną kupę metalu

source: saw a vision of those lost
pl: mam wizję tych którzy przegrali

source: saw a white book
pl: widzę białą książkę

source: saw a white flower
pl: widzę biały kwiat

source: saw an android with red eyes
pl: widzę androida o czerwonych oczach

source: saw conquering invaders
pl: widzi zwycięskich najeźdźców

source: saw emotionless machines
pl: widzę pozbawioną emocji maszynę

source: saw machines enjoying a parade
pl: widzę maszyny bawiące się na paradzie

source: saw machines that believed in the uncertain
pl: widzę maszyny które uwierzyły w niepewne

source: saw my most hated enemy
pl: widzę znienawidzonego wroga

source: saw my old companions
pl: widzę moich starych kompanów

source: saw old companions
pl: widzi swoich starych kompanów

source: saw red eyes gazing down
pl: widzę spojrzenie czerwonych oczu

source: saw soldiers protecting their land
pl: widzę żołnierzy chroniących swój kraj

source: saw something strange yet nostalgic
pl: widzę coś dziwnego, ale nostalgicznego

source: saw squadmates lose their minds
pl: widzę towarzyszy tracących rozum

source: saw swaying flora
pl: widzę kołyszącą się roślinność

source: saw the conquering invaders
pl: widzę zwycięskich najeźdźców

source: saw the enemy take over Earth
pl: widzę wroga przejmującego Ziemię

source: scream if you need to!
pl: krzycz, jeśli musisz!

source: shape.
pl: kształt.

source: she was really worried especially because there was a LOT of blood but it wasn't as bad as it looked so I felt bad for scaring her like that and now
pl: co było głupie, ale naprawdę się martwiła, szczególnie, że było tam DUŻO krwi, ale nie było tak źle, jak wyglądało i więc zrobiło mi się głupio, że ją tak przestraszyłem, i teraz…

source: should be called the journey
pl: powinny być nazywane podróżą

source: show me what you're made of!
pl: pokaż mi do czego jesteś zdolny!

source: since that day it all fell apart
pl: od tego dnia, gdy wszystko się rozpadło

source: so I need all YoRHa units on the surface to head over and investigate.
pl: potrzebujemy zatem, aby wszystkie jednostki YoRHa znajdujące się aktualnie na powierzchni, zbadały tę sprawę.

source: solitude makes people stronger.
pl: samotność wzmacnia ludzi.

source: someone<bt_wait> please<bt_wait> look<bt_wait> my<bt_wait> way
pl: niech<bt_wait> ktoś<bt_wait> na<bt_wait> mnie<bt_wait> spojrzy

source: somewhere very dark
pl: w ciemnym miejscu

source: somewhere very dull
pl: w nudnym miejscu

source: sought more strength
pl: poszukuję siły

source: sprawled on the side of the road
pl: rozciągnięte na poboczu drogi

source: stay optimistic.
pl: pozostań dobrej myśli.

source: stopped trying to think
pl: przestaję myśleć

source: suddenly found myself on the ground
pl: upadam na ziemię

source: suffered a double KO
pl: padam ofiarą podwójnego nokautu

source: suffering makes people grow.
pl: cierpienie sprawia, że ludzie dojrzewają.

source: surrender.
pl: poddaj się.

source: surrounded by the winds of death
pl: wśród wiatrów śmierci

source: survive!
pl: przetrwaj!

source: take a breather.
pl: odetchnij.

source: take it one step at a time.
pl: zajmij się tym krok po kroku.

source: take your time remembering.
pl: zapamiętuj bez pośpiechu.

source: that we’re overreaching
pl: że posuwamy się za daleko

source: the [E]nd of YoRHa
pl: koni[E]c YoRHy

source: the night has just begun.
pl: noc się dopiero zaczęła.

source: the residents of this village have been determined to be safe.
pl: mieszkańcy tej wioski zostali uznani za niegroźnych.

source: the whole world is rooting for you.
pl: cały świat ci kibicuje!

source: then destroy the Goliath-class unit by any means necessary and gather what data you can.
pl: ...a następnie zniszczcie jednostkę klasy Goliat wszelkimi dostępnymi środkami, oraz zbierzcie wszelkie uzyskane dane.

source: there
pl: tam

source: there's light at the end of the tunnel.
pl: na końcu tunelu jest światełko.

source: there's no way you can do it.
pl: nie ma mowy, że dasz radę.

source: there's nothing much I can do because I speak so fast I don't get along with the others and so maybe that's why my memory's not so good either which is why
pl: choć niewiele mogę zrobić, bo mówię tak szybko, że nie dogaduję się z innymi. I może z tego powodu mam też problemy z pamięcią? Tak, czy siak, dlatego...

source: there's nothing to worry about!
pl: nie ma się czym przejmować!

source: there's still a long way to go.
pl: przed tobą jeszcze długa droga.

source: this game is crap anyway.
pl: ta gra to i tak gówno.

source: thought of a loved one
pl: myśli o ukochanej osobie

source: thought of many friends
pl: myśli o swoich przyjaciołach

source: thought of my beloved
pl: myślę o ukochanej osobie

source: thought of my many friends
pl: myślę o moich przyjaciołach

source: thunder or snow...
pl: burzy czy śniegu...

source: time to rela[X]
pl: czas na rela[X]

source: to do this...for me...
pl: Żebyś to zrobiła... dla mnie...

source: to push forward
pl: by przeć naprzód

source: to replace what we’d lost
pl: by zastąpić co straciliśmy

source: took it to the limit
pl: chce poznać swoje możliwości

source: tried taking on a powerful foe
pl: próbuję pokonać potężnego wroga

source: try to relax.
pl: spróbuj się rozluźnić.

source: try to stay cool.
pl: spróbuj zachować spokój.

source: turn the power off.
pl: wyłącz zasilanie.

source: turned my back on the enemy
pl: odwracam się od wroga

source: underestimated the enemy
pl: nie doceniam wroga

source: underground
pl: pod ziemią

source: used up all my strength
pl: wykorzystuję resztę siłę

source: vowed revenge
pl: ślubuję zemstę

source: vowed to grow as a person
pl: ślubuję rozwijać się jako osoba

source: vowed vengeance
pl: ślubuję odpłatę

source: wallow in despair!
pl: pogrąż się w rozpaczy!

source: wanted to know my own limits
pl: chcę poznać swoje możliwości

source: was ambushed by the enemy
pl: wpadam w zasadzkę

source: was amused by how it all ended
pl: śmieje się z własnego upadku

source: was attacked from behind
pl: padam ofiarą ataku od tyłu

source: was backed into a corner
pl: daję się zapędzić w róg

source: was careless
pl: padam ofiarą swojej lekkomyślności

source: was distracted by a flower
pl: wolę zbierać kwiaty

source: was overcome by fear
pl: padam ofiarą strachu

source: was overwhelmed
pl: nie jestem w stanie się obronić

source: was shocked at what happened
pl: jestem w szoku ostatnich wydarzeń

source: was surrounded by enemies
pl: jestem otoczony przez wrogów

source: was too damn lazy
pl: przeklina swoją bezczynność

source: was totally outmatched
pl: nie ma szans z wrogiem

source: was trapped on the defensive
pl: próbuję się bronić

source: wasn't fast enough
pl: nie mam dość szybkości

source: wasn't in top form
pl: nie jest w szczytowej formie
